/* =========================================================== */
//# 36ke
/* _____________________________ */
// ## 1 大数危机 [033-G JavaScript 浮点数陷阱及解法]
0.1+0.2 //0.30000000000000004 
0.1+0.2 == 0.3 // false

// ## 2 变量作用域
function createFunction(){
    var result=new Array()
    for(var i=0;i<10;i++){
        result[i]=function(){return i}
    }
    return result
}
createFunction().forEach(item=>{
    console.log(item())
}) // 10 个10 


/* =========================================================== */
// # haoweilai-yuwen
// ## 1 // $_PS: 此处前面 ; 非面试题中出现，只是;必须使用的一种情况
;[]?!![]:![] // true 

// ## 2 循环条件
let k;
for(var i=0,j=0;i<10,j<8;i++,j++){
    k=i+j;
}
console.log(k) // 14


/* =========================================================== */


